#### Platform Infrastructure Plan 📖
#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📋 `success`

<details><summary>Show Plan</summary>

```terraform
module.self_healing_cicd.data.archive_file.lambda_zip: Reading...
module.self_healing_cicd.data.archive_file.lambda_zip: Read complete after 0s [id=681709ab6580b782a43426c104a680b17666b0d2]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=522579114515]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.self_healing_cicd.aws_cloudwatch_dashboard.pipeline_monitoring will be created
  + resource "aws_cloudwatch_dashboard" "pipeline_monitoring" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/CodeBuild",
                                  + "Builds",
                                  + {
                                      + label = "Total Builds"
                                      + stat  = "Sum"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "SuccessfulBuilds",
                                  + {
                                      + label = "Successful"
                                      + stat  = "Sum"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "FailedBuilds",
                                  + {
                                      + label = "Failed"
                                      + stat  = "Sum"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "ap-northeast-1"
                          + stat    = "Sum"
                          + title   = "Build Status"
                          + view    = "timeSeries"
                          + yAxis   = {
                              + left = {
                                  + min = 0
                                }
                            }
                        }
                      + type       = "metric"
                    },
                  + {
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/CodeBuild",
                                  + "Duration",
                                  + {
                                      + label = "Avg Build Time (min)"
                                      + stat  = "Average"
                                    },
                                  + {
                                      + label = "Min Build Time (min)"
                                      + stat  = "Minimum"
                                    },
                                  + {
                                      + label = "Max Build Time (min)"
                                      + stat  = "Maximum"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "ap-northeast-1"
                          + stat    = "Average"
                          + title   = "Build Duration"
                          + view    = "timeSeries"
                          + yAxis   = {
                              + left = {
                                  + label = "Minutes"
                                  + min   = 0
                                }
                            }
                        }
                      + type       = "metric"
                    },
                  + {
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/Lambda",
                                  + "Invocations",
                                  + {
                                      + dimensions = {
                                          + FunctionName = "frexida-self-healing-pipeline-ai-error-handler"
                                        }
                                      + label      = "Lambda Invocations"
                                      + stat       = "Sum"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Errors",
                                  + {
                                      + dimensions = {
                                          + FunctionName = "frexida-self-healing-pipeline-ai-error-handler"
                                        }
                                      + label      = "Lambda Errors"
                                      + stat       = "Sum"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Duration",
                                  + {
                                      + dimensions = {
                                          + FunctionName = "frexida-self-healing-pipeline-ai-error-handler"
                                        }
                                      + label      = "Avg Duration (ms)"
                                      + stat       = "Average"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "ap-northeast-1"
                          + title   = "Lambda Metrics"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                    },
                  + {
                      + properties = {
                          + query  = <<-EOT
                                SOURCE '/aws/codebuild/frexida-self-healing-pipeline'
                                | fields @timestamp, @message
                                | filter @message like /ERROR|FAILED/
                                | sort @timestamp desc
                                | limit 20
                            EOT
                          + region = "ap-northeast-1"
                          + title  = "Recent Errors"
                        }
                      + type       = "log"
                    },
                  + {
                      + properties = {
                          + metrics = [
                              + [
                                  + "SelfHealingPipeline",
                                  + "RetryCount",
                                  + {
                                      + label = "Total Retries"
                                      + stat  = "Sum"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "AIAgentInvocations",
                                  + {
                                      + label = "AI Agent Calls"
                                      + stat  = "Sum"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "PatchSuccessRate",
                                  + {
                                      + label = "Patch Success Rate (%)"
                                      + stat  = "Average"
                                    },
                                ],
                            ]
                          + period  = 86400
                          + region  = "ap-northeast-1"
                          + title   = "Daily Statistics"
                          + view    = "singleValue"
                        }
                      + type       = "metric"
                    },
                ]
            }
        )
      + dashboard_name = "frexida-self-healing-pipeline-monitoring"
      + id             = (known after apply)
    }

  # module.self_healing_cicd.aws_cloudwatch_event_rule.codebuild_failure will be created
  + resource "aws_cloudwatch_event_rule" "codebuild_failure" {
      + arn            = (known after apply)
      + description    = "Trigger only when CodeBuild fails (not on success)"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + build-status = [
                      + "FAILED",
                    ]
                  + project-name = [
                      + "frexida-self-healing-pipeline",
                    ]
                }
              + detail-type = [
                  + "CodeBuild Build State Change",
                ]
              + source      = [
                  + "aws.codebuild",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "frexida-self-healing-pipeline-build-failure"
      + name_prefix    = (known after apply)
      + tags           = {
          + "Environment" = "production"
        }
      + tags_all       = {
          + "Environment" = "production"
        }
    }

  # module.self_healing_cicd.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "frexida-self-healing-pipeline-build-failure"
      + target_id      = "TriggerLambda"
    }

  # module.self_healing_cicd.aws_cloudwatch_event_target.sns_target will be created
  + resource "aws_cloudwatch_event_target" "sns_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "frexida-self-healing-pipeline-build-failure"
      + target_id      = "SendToSNS"
    }

  # module.self_healing_cicd.aws_cloudwatch_log_group.codebuild_logs will be created
  + resource "aws_cloudwatch_log_group" "codebuild_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/codebuild/frexida-self-healing-pipeline"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "production"
        }
      + tags_all          = {
          + "Environment" = "production"
        }
    }

  # module.self_healing_cicd.aws_cloudwatch_log_group.lambda_logs will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/frexida-self-healing-pipeline-ai-error-handler"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "production"
        }
      + tags_all          = {
          + "Environment" = "production"
        }
    }

  # module.self_healing_cicd.aws_cloudwatch_metric_alarm.cost_alert will be created
  + resource "aws_cloudwatch_metric_alarm" "cost_alert" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when estimated charges exceed $20"
      + alarm_name                            = "frexida-self-healing-pipeline-cost-alert"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Currency" = "USD"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EstimatedCharges"
      + namespace                             = "AWS/Billing"
      + period                                = 21600
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Environment" = "production"
        }
      + tags_all                              = {
          + "Environment" = "production"
        }
      + threshold                             = 20
      + treat_missing_data                    = "missing"
    }

  # module.self_healing_cicd.aws_cloudwatch_metric_alarm.high_failure_rate will be created
  + resource "aws_cloudwatch_metric_alarm" "high_failure_rate" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when build failure rate is high"
      + alarm_name                            = "frexida-self-healing-pipeline-high-failure-rate"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ProjectName" = "frexida-self-healing-pipeline"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "FailedBuilds"
      + namespace                             = "AWS/CodeBuild"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Environment" = "production"
        }
      + tags_all                              = {
          + "Environment" = "production"
        }
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

  # module.self_healing_cicd.aws_cloudwatch_metric_alarm.infinite_loop_detection will be created
  + resource "aws_cloudwatch_metric_alarm" "infinite_loop_detection" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when too many retries occur"
      + alarm_name                            = "frexida-self-healing-pipeline-infinite-loop"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "RetryCount"
      + namespace                             = "SelfHealingPipeline"
      + period                                = 3600
      + statistic                             = "Sum"
      + tags                                  = {
          + "Environment" = "production"
        }
      + tags_all                              = {
          + "Environment" = "production"
        }
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # module.self_healing_cicd.aws_codebuild_project.self_healing will be created
  + resource "aws_codebuild_project" "self_healing" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 30
      + description          = "Self-healing CI/CD pipeline with AI-powered error correction"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "frexida-self-healing-pipeline"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + service_role         = (known after apply)
      + source_version       = "main"
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
        }

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "NO_ARTIFACTS"
        }

      + cache {
          + location = (known after apply)
          + type     = "S3"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/standard:7.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "AI_AGENT_ENDPOINT"
              + type  = "PLAINTEXT"
              + value = "https://api.frexida.com/ci-result"
            }
          + environment_variable {
              + name  = "GITHUB_TOKEN"
              + type  = "SECRETS_MANAGER"
              + value = (known after apply)
            }
          + environment_variable {
              + name  = "RETRY_COUNT"
              + type  = "PLAINTEXT"
              + value = "0"
            }
        }

      + logs_config {
          + cloudwatch_logs {
              + group_name  = "/aws/codebuild/frexida-self-healing-pipeline"
              + status      = "ENABLED"
              + stream_name = "build-logs"
            }
        }

      + source {
          + buildspec       = "buildspec.yml"
          + git_clone_depth = 1
          + location        = "https://github.com/Frexida/infra.git"
          + type            = "GITHUB"

          + git_submodules_config {
              + fetch_submodules = false
            }
        }
    }

  # module.self_healing_cicd.aws_codebuild_webhook.github will be created
  + resource "aws_codebuild_webhook" "github" {
      + build_type   = "BUILD"
      + id           = (known after apply)
      + payload_url  = (known after apply)
      + project_name = "frexida-self-healing-pipeline"
      + secret       = (sensitive value)
      + url          = (known after apply)

      + filter_group {
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "PUSH"
              + type                    = "EVENT"
            }
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "^refs/heads/main$"
              + type                    = "HEAD_REF"
            }
        }
    }

  # module.self_healing_cicd.aws_dynamodb_table.retry_tracking will be created
  + resource "aws_dynamodb_table" "retry_tracking" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "build_id"
      + id               = (known after apply)
      + name             = "frexida-self-healing-pipeline-retry-tracking"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
        }
      + tags_all         = {
          + "Environment" = "production"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "build_id"
          + type = "S"
        }

      + ttl {
          + attribute_name = "expiration_time"
          + enabled        = true
        }
    }

  # module.self_healing_cicd.aws_iam_role.codebuild_role will be created
  + resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "frexida-self-healing-pipeline-codebuild-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
        }
      + tags_all              = {
          + "Environment" = "production"
        }
      + unique_id             = (known after apply)
    }

  # module.self_healing_cicd.aws_iam_role.lambda_ai_handler will be created
  + resource "aws_iam_role" "lambda_ai_handler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "frexida-self-healing-pipeline-lambda-ai-handler-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
        }
      + tags_all              = {
          + "Environment" = "production"
        }
      + unique_id             = (known after apply)
    }

  # module.self_healing_cicd.aws_iam_role_policy.codebuild_policy will be created
  + resource "aws_iam_role_policy" "codebuild_policy" {
      + id          = (known after apply)
      + name        = "frexida-self-healing-pipeline-codebuild-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.self_healing_cicd.aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id          = (known after apply)
      + name        = "frexida-self-healing-pipeline-lambda-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.self_healing_cicd.aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "frexida-self-healing-pipeline-lambda-ai-handler-role"
    }

  # module.self_healing_cicd.aws_lambda_function.ai_error_handler will be created
  + resource "aws_lambda_function" "ai_error_handler" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/self-healing-cicd/lambda-package.zip"
      + function_name                  = "frexida-self-healing-pipeline-ai-error-handler"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Ccwi5WKCy7OetC5TOH8tPcguf6s7g96cfAe2V0OHk7I="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "production"
        }
      + tags_all                       = {
          + "Environment" = "production"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.self_healing_cicd.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "frexida-self-healing-pipeline-ai-error-handler"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.self_healing_cicd.aws_lambda_permission.allow_sns will be created
  + resource "aws_lambda_permission" "allow_sns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "frexida-self-healing-pipeline-ai-error-handler"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.self_healing_cicd.aws_s3_bucket.build_cache will be created
  + resource "aws_s3_bucket" "build_cache" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "frexida-codebuild-cache-production"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "production"
          + "Purpose"     = "CodeBuild cache"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "Purpose"     = "CodeBuild cache"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.self_healing_cicd.aws_s3_bucket_lifecycle_configuration.build_cache_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "build_cache_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete-old-cache"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = false
            }
        }
    }

  # module.self_healing_cicd.aws_s3_bucket_public_access_block.build_cache will be created
  + resource "aws_s3_bucket_public_access_block" "build_cache" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.self_healing_cicd.aws_secretsmanager_secret.github_token will be created
  + resource "aws_secretsmanager_secret" "github_token" {
      + arn                            = (known after apply)
      + description                    = "GitHub token for self-healing pipeline"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "frexida-self-healing-pipeline/github-token"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Environment" = "production"
        }
      + tags_all                       = {
          + "Environment" = "production"
        }
    }

  # module.self_healing_cicd.aws_secretsmanager_secret_version.github_token will be created
  + resource "aws_secretsmanager_secret_version" "github_token" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.self_healing_cicd.aws_sns_topic.build_failure will be created
  + resource "aws_sns_topic" "build_failure" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + display_name                = "CodeBuild Failure Notifications"
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "frexida-self-healing-pipeline-build-failures"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "production"
        }
      + tags_all                    = {
          + "Environment" = "production"
        }
      + tracing_config              = (known after apply)
    }

  # module.self_healing_cicd.aws_sns_topic_policy.build_failure_policy will be created
  + resource "aws_sns_topic_policy" "build_failure_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # module.self_healing_cicd.aws_sns_topic_subscription.lambda_subscription will be created
  + resource "aws_sns_topic_subscription" "lambda_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudwatch_dashboard_url = "https://console.aws.amazon.com/cloudwatch/home?region=ap-northeast-1#dashboards:name=frexida-self-healing-pipeline-monitoring"
  + codebuild_project_name   = "frexida-self-healing-pipeline"
  + instructions             = <<-EOT
        ============================================================
        Self-Healing CI/CD Pipeline Setup Complete!
        ============================================================
        
        1. Get the webhook URL:
           terraform output -raw webhook_url
        
        2. Add webhook to GitHub:
           - Go to: https://github.com/Frexida/infra.git/settings/hooks
           - Click "Add webhook"
           - Paste the webhook URL
           - Content type: application/json
           - Select: Just the push event
           - Click "Add webhook"
        
        3. Add buildspec.yml to your repository root
           Copy from: modules/self-healing-cicd/buildspec.yml
        
        4. Monitor your pipeline:
           https://console.aws.amazon.com/cloudwatch/home?region=ap-northeast-1#dashboards:name=frexida-self-healing-pipeline-monitoring
        
        5. Test by pushing code with an intentional error!
        
        ============================================================
    EOT
  + lambda_function_name     = "frexida-self-healing-pipeline-ai-error-handler"
  + sns_topic_arn            = (known after apply)
  + webhook_url              = (sensitive value)

Warning: Invalid Attribute Combination

  with module.self_healing_cicd.aws_s3_bucket_lifecycle_configuration.build_cache_lifecycle,
  on ../../modules/self-healing-cicd/codebuild.tf line 78, in resource "aws_s3_bucket_lifecycle_configuration" "build_cache_lifecycle":
  78: resource "aws_s3_bucket_lifecycle_configuration" "build_cache_lifecycle" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mtdnot, Action: `pull_request`*